huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
private:
    uint8_t* read_buffer_ = nullptr;
};

class Cst816s : public I2cDevice {
public:
    struct TouchPoint_t {
        int num = 0;
        int x = -1;
        int y = -1;
    };

    enum TouchEvent {
        TOUCH_NONE,
        TOUCH_PRESS,
        TOUCH_RELEASE,
        TOUCH_HOLD
    };

    Cst816s(i2c_master_bus_handle_t i2c_bus, uint8_t addr) : I2cDevice(i2c_bus, addr)
    {
        read_buffer_ = new uint8_t[6];
        was_touched_ = false;
        press_count_ = 0;

        // Create touch interrupt semaphore
        touch_isr_mux_ = xSemaphoreCreateBinary();
        if (touch_isr_mux_ == NULL) {
            ESP_LOGE(TAG, "Failed to create touch semaphore");
        }
    }

    ~Cst816s()
    {
        delete[] read_buffer_;

        // Delete semaphore if it exists
        if (touch_isr_mux_ != NULL) {
            vSemaphoreDelete(touch_isr_mux_);
            touch_isr_mux_ = NULL;
        }
    }

    void UpdateTouchPoint()
    {
        ReadRegs(0x02, read_buffer_, 6);
        tp_.num = read_buffer_[0] & 0x0F;
        tp_.x = ((read_buffer_[1] & 0x0F) << 8) | read_buffer_[2];
        tp_.y = ((read_buffer_[3] & 0x0F) << 8) | read_buffer_[4];
    }

    const TouchPoint_t &GetTouchPoint()
    {
        return tp_;
    }

    TouchEvent CheckTouchEvent()
    {
        bool is_touched = (tp_.num > 0);
        TouchEvent event = TOUCH_NONE;

        if (is_touched && !was_touched_) {
            // Press event (transition from not touched to touched)
            press_count_++;
            event = TOUCH_PRESS;
            ESP_LOGI(TAG, "TOUCH PRESS - count: %d, x: %d, y: %d", press_count_, tp_.x, tp_.y);
        } else if (!is_touched && was_touched_) {
            // Release event (transition from touched to not touched)
            event = TOUCH_RELEASE;
            ESP_LOGI(TAG, "TOUCH RELEASE - total presses: %d", press_count_);
        } else if (is_touched && was_touched_) {
            // Continuous touch (hold)
            event = TOUCH_HOLD;
            ESP_LOGD(TAG, "TOUCH HOLD - x: %d, y: %d", tp_.x, tp_.y);
        }

        // Update previous state
        was_touched_ = is_touched;
        return event;
    }

    int GetPressCount() const
    {
        return press_count_;
    }

    void ResetPressCount()
    {
        press_count_ = 0;
    }

    // Clear the press/release tracking so the next touch reads as a fresh
    // transition. Used on light-sleep wake so a stale LCD edge cannot produce
    // an accidental tap, mode entry, drink confirmation, or chat toggle.
    void ResetTouchState()
    {
        was_touched_ = false;
        press_count_ = 0;
    }

    // Semaphore management methods
    SemaphoreHandle_t GetTouchSemaphore()
    {
        return touch_isr_mux_;
    }

    bool WaitForTouchEvent(TickType_t timeout = portMAX_DELAY)
    {
        if (touch_isr_mux_ != NULL) {
            return xSemaphoreTake(touch_isr_mux_, timeout) == pdTRUE;
        }
        return false;
    }

    void NotifyTouchEvent()
    {
        if (touch_isr_mux_ != NULL) {
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            xSemaphoreGiveFromISR(touch_isr_mux_, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }
    }

private:
    uint8_t* read_buffer_ = nullptr;
    TouchPoint_t tp_;

    // Touch state tracking
    bool was_touched_;
    int press_count_;

    // Touch interrupt semaphore
    SemaphoreHandle_t touch_isr_mux_;
};

// Unified interaction gesture vocabulary.
enum class Gesture {
    None,
    Tap,
    LongPress,
    SwipeLeft,
    SwipeRight,
    SwipeUp,
    SwipeDown,
    Pet,
    Shake,
    ChatToggle,
};

// The active screen is tracked authoritatively by EspVocatUi::CurrentScreen()
// (ScreenId in main/display/esp_vocat_ui.h). The old emote-gfx "mode" enum was
// retired in favour of that single source of truth.

class EspVocat : public WifiBoard {
private:
    i2c_master_bus_handle_t i2c_bus_;
    i2c_bus_handle_t shared_i2c_bus_handle_ = nullptr;
    Cst816s* cst816s_;
    Charge* charge_;
    Button boot_button_;
    Display* display_ = nullptr;
    // Screen manager that alternates the shared panel between the emote pet
    // renderer (Home) and LVGL page screens. Owns the RenderSwitch and tracks
    // the current screen (the authoritative source for gesture routing).
    EspVocatUi* ui_ = nullptr;
    // The screen currently presented. Falls back to Home before ui_ is built so
    // the interaction timers can run safely during boot.
    ScreenId CurrentScreen() const
    {
        return (ui_ != nullptr) ? ui_->CurrentScreen() : ScreenId::Home;
    }
    PwmBacklight* backlight_ = nullptr;
    esp_timer_handle_t touchpad_timer_;
    esp_lcd_touch_handle_t tp;   // LCD touch handle
    EspVideo* camera_ = nullptr;
    TaskHandle_t charge_task_handle_ = nullptr;
    TaskHandle_t touch_task_handle_ = nullptr;
    TaskHandle_t imu_task_handle_ = nullptr;
    TaskHandle_t touch_slider_task_handle_ = nullptr;
    esp_timer_handle_t emotion_reset_timer_ = nullptr;
    esp_timer_handle_t reminder_timer_ = nullptr;
    bool bmi270_ready_ = false;
    touch_slider_handle_t touch_slider_handle_ = nullptr;
    touch_button_handle_t touch_button_handle_ = nullptr;

    // Emotion learning: index of currently displayed emotion
    size_t current_emotion_index_ = 0;

    // Emotion learning: list of emotions to show
    static const char* kEmotionLearningEmotions_[];
    static const char* kEmotionLearningNames_[];
    static constexpr size_t kEmotionLearningCount = 8;

    // Habit tracking state (persisted fields).
    struct HabitState {
        int64_t last_drink_time;  // Unix timestamp of last drink
        int drink_streak;         // Consecutive drink completions today
    };
    HabitState habit_state_ = {};

    // Habit configuration
    static constexpr int64_t kDrinkReminderIntervalMs = 60 * 60 * 1000;  // 60 minutes in ms

    // Unified reminder record. Exactly one reminder is presented at a time; a
    // second due reminder is deferred until the active one is handled.
    struct Reminder {
        enum class Type { Drink, Schedule };
        Type type;
        const char* message;
        const char* emotion;
        std::string_view sound;
        int64_t due_time_ms;
        bool handled;  // true once acknowledged or given up on
    };

    // Unified reminder queue state. The timer only enqueues due reminders;
    // ShowNextReminder()/DismissReminder() own presentation and acknowledgement.
    Reminder reminder_ = {};
    bool reminder_active_ = false;               // a reminder is currently shown
    bool reminder_pending_ = false;              // reminder awaits resolution (shown or snoozed)
    int reminder_snooze_count_ = 0;              // ignores for the active reminder
    int64_t reminder_shown_ms_ = 0;              // when the active reminder was last shown
    int64_t reminder_quiet_until_ms_ = 0;        // suppress a drink reminder until this time
    SemaphoreHandle_t reminder_mutex_ = nullptr; // guards all reminder state
    esp_timer_handle_t reminder_restore_timer_ = nullptr; // deferred standby-restore
    bool reminder_restore_pending_ = false;               // standby restore is armed
    static constexpr uint32_t kDrinkSuccessDurationMs = 3000;  // loving face duration (ms)
    static constexpr int kReminderMaxSnooze = 3; // bounded retries before going quiet
    static constexpr int64_t kReminderAutoSnoozeMs = 60 * 1000;  // re-remind after no action

