huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
    // Daily schedule reminders (hour, minute, message, emotion).
    struct ScheduleEntry {
        int hour;
        int minute;
        const char* message;
        const char* emotion;
    };
    static const ScheduleEntry kScheduleReminders_[];
    static constexpr size_t kScheduleCount = 5;

    static constexpr const char* kDrinkReminderMessage = "该喝水了~";
    static constexpr const char* kDrinkReminderEmotion = "delicious";  // water/drink-oriented

    // Touch swipe detection for CST816S
    bool swipe_start_recorded_ = false;
    int64_t touch_press_time_ms_ = 0;
    int swipe_start_x_ = 0;
    int swipe_start_y_ = 0;
    static constexpr int kSwipeThreshold = 80;  // Minimum swipe distance

    // Outer capacitive "pet" surface feedback cooldown (moved from a hidden
    // static local so it is not hidden state).
    static constexpr int64_t kOuterTouchCooldownUs = 1200000;  // 1200 ms
    int64_t outer_touch_last_us_ = 0;

    // Settings page values are driven by the LVGL screen's steppers and the Task 3
    // callbacks (which apply to backlight/AudioService live); no board-side
    // selection/adjust state is needed anymore.

    // Display presentation owner. Higher layers take priority and are restored
    // by ResetToStandby(), so transient/mode/reminder feedback do not clobber
    // each other or the standby idle animation (spec §3.4).
    enum class Presentation {
        Standby,            // idle pet animation (lowest priority)
        Mode,               // mode presentation (function/settings/emotion-learning)
        Reminder,           // active reminder (highest priority)
        TransientFeedback,  // short touch/shake feedback
    };
    Presentation presentation_ = Presentation::Standby;

    // Screen navigation state, read/written only from the interaction
    // task/callback context (touch events and timer callbacks), so it does not
    // require locking. The active screen itself is held by ui_->CurrentScreen().
    static constexpr uint64_t kModeIdleTimeoutMs = 30000;  // Non-Home idle timeout (ms) before returning Home
    esp_timer_handle_t mode_idle_timer_ = nullptr;
    // True when the last touch began in the right-edge zone: a horizontal swipe
    // from there means "back Home" instead of page navigation (round-panel
    // safety, avoiding a direction misread on the far edge).
    bool swipe_from_edge_ = false;
    // Right-edge width used by edge-swipe "back Home" detection.
    static constexpr int kEdgeZonePx = 60;
    // Last value driven to ui_->SetSpeaking(); polled from the device state so a
    // change only re-locks LVGL when the listening/speaking sense actually flips.
    bool last_speaking_state_ = false;
    esp_timer_handle_t state_poll_timer_ = nullptr;  // maps device state -> SetSpeaking

    // Two-level power save (spec §6.1). Level 1 is a 1s tick that turns off the
    // display after DISPLAY_SLEEP_TIMEOUT_SECONDS of eligible idle while keeping
    // the wake word available. Level 2 reuses the common PowerSaveTimer for a
    // light sleep after LIGHT_SLEEP_TIMEOUT_SECONDS, gated by UpdatePowerSaveEligibility().
    PowerSaveTimer* power_save_timer_ = nullptr;
    esp_timer_handle_t display_sleep_timer_ = nullptr;
    int display_idle_ticks_ = 0;      // seconds since the last eligible interaction
    bool display_sleep_active_ = false;  // level-1 display sleep is on
    static constexpr int kDisplaySleepTimeoutSeconds = DISPLAY_SLEEP_TIMEOUT_SECONDS;
    static constexpr int kLightSleepTimeoutSeconds = LIGHT_SLEEP_TIMEOUT_SECONDS;

    static void mode_idle_timer_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self == nullptr || self->CurrentScreen() == ScreenId::Home || self->reminder_active_) {
            return;
        }
        // A live conversation (overlay up) is active interaction: never auto-close
        // it via the idle-to-Home timer. It ends only by navigation. The timer is
        // one-shot, so re-arm it to keep this gate armed until the user leaves.
        if (self->CurrentScreen() == ScreenId::ConversationOverlay) {
            self->ResetModeIdleTimer();
            return;
        }
        self->ExitToChat();
    }

    void OnGesture(Gesture gesture)
    {
        // Any normalized gesture is interaction: reset both power-save countdowns
        // and wake the display if it had fallen to level-1 sleep (spec §6.2).
        TouchPowerSaveActivity();
        ResetModeIdleTimer();
        // Reminder-first routing: a visible reminder owns screen gestures so it
        // can be acknowledged. Reminders only present on the Home pet-cat screen;
        // if one stays active while a non-Home page is up, never hijack that
        // page's navigation — let the swipe return Home first, then the reminder
        // re-engages there (avoids an invisible reminder blocking the way back).
        if (reminder_active_ && CurrentScreen() == ScreenId::Home) {
            HandleReminderGesture(gesture);
            return;
        }
        switch (CurrentScreen()) {
        case ScreenId::Home:
            HandleChatGesture(gesture);
            break;
        case ScreenId::Settings:
            HandleSettingsPageGesture(gesture);
            break;
        case ScreenId::EmotionLearning:
            HandleEmotionLearningGesture(gesture);
            break;
        case ScreenId::ConversationOverlay:
            // A conversation is a non-Home screen too: any horizontal/up swipe
            // leaves it (ExitToChat force-stops the dialogue, bug #2).
            HandleSettingsPageGesture(gesture);
            break;
        }
    }

    // Return to the Home emote pet face from any non-Home screen. If a
    // conversation overlay is up, SetConversationActive(false) fires the
    // dialog-gone callback, whose board handler force-stops the voice pipeline
    // (StopListening + AbortSpeaking) — this is the bug #2 fix: leaving a
    // conversation by any navigation stops the audio.
    void ExitToChat()
    {
        if (CurrentScreen() == ScreenId::Home) {
            return;
        }
        if (ui_ != nullptr) {
            ui_->SetConversationActive(false);  // fires dialog-gone -> force-stop
            ui_->ShowHome();
        }
        if (mode_idle_timer_ != nullptr) {
            esp_timer_stop(mode_idle_timer_);
        }
        // Back in the root Home state: re-allow light sleep if no reminder is up.
        UpdatePowerSaveEligibility();
    }

    // Force-end any active conversation before leaving Home (bug #2). Covers both
    // the LVGL overlay conversation (LongPress: SetConversationActive(false)
    // fires dialog-gone → force-stop) and conversations started by the BOOT
    // button / wake word, which run directly on the voice pipeline without the
    // overlay. In that second case the overlay was never up, so also stop a
    // device that is currently listening/speaking explicitly — this is
    // idempotent with the dialog-gone path and guarantees navigation away can
    // never leave the audio running over a page screen.
    void ForceEndDialogue()
    {
        if (ui_ != nullptr) {
            ui_->SetConversationActive(false);  // fires dialog-gone if overlay up
        }
        auto& app = Application::GetInstance();
        auto state = app.GetDeviceState();
        if (state == kDeviceStateListening || state == kDeviceStateSpeaking) {
            app.StopListening();
            app.AbortSpeaking(kAbortReasonNone);
        }
    }

