huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
    // Post-screen-change bookkeeping shared by the Enter* navigations.
    void AfterScreenChange()
    {
        ResetModeIdleTimer();
        UpdatePowerSaveEligibility();
    }

    // Drive the conversation overlay's listening/speaking state from the device
    // state machine, on a light periodic poll. Re-locks LVGL only when the sense
    // actually flips; a no-op while the overlay is not shown.
    static void state_poll_timer_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self != nullptr) {
            self->PollSpeakingState();
        }
    }

    void PollSpeakingState()
    {
        if (ui_ == nullptr) {
            return;
        }
        auto state = Application::GetInstance().GetDeviceState();
        bool new_state = last_speaking_state_;
        if (state == kDeviceStateSpeaking) {
            new_state = true;
        } else if (state == kDeviceStateListening) {
            new_state = false;
        }
        if (new_state != last_speaking_state_) {
            last_speaking_state_ = new_state;
            ui_->SetSpeaking(new_state);
        }
    }

    void ResetModeIdleTimer()
    {
        if (mode_idle_timer_ == nullptr) {
            return;
        }
        esp_timer_stop(mode_idle_timer_);
        esp_timer_start_once(mode_idle_timer_, kModeIdleTimeoutMs * 1000ULL);
    }

    // Return the display to the standby idle pet animation on the Home screen.
    // Non-Home page screens are presented by ShowScreen and are not reset here.
    // Stops any transient animation and cannot permanently overwrite a reminder
    // presentation, so feedback layers stay isolated (spec §3.4).
    void ResetToStandby()
    {
        if (display_ == nullptr) {
            return;
        }
        if (emotion_reset_timer_ != nullptr) {
            esp_timer_stop(emotion_reset_timer_);
        }
        if (CurrentScreen() == ScreenId::Home) {
            presentation_ = Presentation::Standby;
            // Restarts the standby idle pet animation.
            static_cast<emote::EmoteDisplay*>(display_)->RestoreFromReminder();
        }
        // Non-Home screens (Settings / EmotionLearning / ConversationOverlay) are
        // owned by the LVGL page presentation; nothing to restore here.
    }

    // Per-screen gesture handlers. Note: Pet and Shake must never change screen.
    // Gesture matrix (Home = emote pet face; everything else is a non-Home LVGL
    // screen): Home — LongPress opens a conversation, SwipeLeft → EmotionLearning,
    // SwipeRight → Settings, Tap/Shake → feedback. Non-Home screens — any
    // horizontal or up swipe returns Home; on-screen ‹ back also returns Home.
    void HandleChatGesture(Gesture gesture)
    {
        switch (gesture) {
        case Gesture::SwipeLeft:
            // An edge-start swipe means "back Home" (already Home) so it does not
            // accidentally navigate from the round panel's right edge.
            if (swipe_from_edge_) {
                break;
            }
            EnterEmotionLearningMode();
            break;
        case Gesture::SwipeRight:
            if (swipe_from_edge_) {
                break;
            }
            EnterSettingsPage();
            break;
        case Gesture::LongPress:
            // Open a conversation: show the Siri-style overlay and start voice.
            StartConversation();
            break;
        case Gesture::Tap:
            // Light touch feedback without leaving Home.
            ShowTemporaryEmotion("happy", 1500);
            Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_POPUP);
            break;
        case Gesture::Shake:
            // "被摇晃" feedback: shake is meaningful only in Home (spec §1.3).
            ShowTemporaryEmotion("confused", 1800);
            ESP_LOGI(TAG, "Shake feedback (Home screen)");
            break;
        default:
            // Ignore gestures not used on Home (SwipeUp, SwipeDown, Pet, ChatToggle,
            // None). A swipe must never toggle chat.
            break;
        }
    }

    // Non-Home LVGL screens (Settings / EmotionLearning / ConversationOverlay)
    // share this matrix: any horizontal or up swipe returns Home. SwipeDown is
    // ignored. Value changes on Settings and emotion stepping on EmotionLearning
    // happen through the screens' on-screen controls, not gestures.
    void HandlePageGesture(Gesture gesture)
    {
        switch (gesture) {
        case Gesture::SwipeLeft:
        case Gesture::SwipeRight:
        case Gesture::SwipeUp:
            ExitToChat();
            break;
        case Gesture::Tap:
            // Light touch feedback — but not during a live conversation overlay,
            // where an audible blip would distract from the ongoing dialogue.
            if (CurrentScreen() == ScreenId::ConversationOverlay) {
                break;
            }
            ShowTemporaryEmotion("happy", 1500);
            Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_POPUP);
            break;
        default:
            break;
        }
    }

    void HandleSettingsPageGesture(Gesture gesture)
    {
        HandlePageGesture(gesture);
    }

    void HandleEmotionLearningGesture(Gesture gesture)
    {
        HandlePageGesture(gesture);
    }

    // Gesture timing thresholds (ms)
    static constexpr int64_t kLongPressThresholdMs = 1200;

    static void emotion_reset_timer_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        // Return to the presentation appropriate for the current mode instead of
        // blindly resetting to "neutral", which would wipe a mode/reminder state.
        if (self != nullptr) {
            self->ResetToStandby();
        }
    }

    void LoadHabitState()
    {
        Settings s("habit", false);
        habit_state_.last_drink_time = s.GetInt("last_drink", 0);
        habit_state_.drink_streak = s.GetInt("drink_streak", 0);
        ESP_LOGI(TAG, "Habit state loaded: last_drink=%" PRId64 ", streak=%d",
                  habit_state_.last_drink_time, habit_state_.drink_streak);
    }

    void SaveHabitState()
    {
        Settings s("habit", true);
        s.SetInt("last_drink", habit_state_.last_drink_time);
        s.SetInt("drink_streak", habit_state_.drink_streak);
        ESP_LOGI(TAG, "Habit state saved: last_drink=%" PRId64 ", streak=%d",
                  habit_state_.last_drink_time, habit_state_.drink_streak);
    }

    void MarkDrinkCompleted()
    {
        int64_t now_ms = esp_timer_get_time() / 1000;
        habit_state_.last_drink_time = now_ms;
        habit_state_.drink_streak++;
        SaveHabitState();

        ESP_LOGI(TAG, "Drink completed! Streak: %d", habit_state_.drink_streak);
        ShowTemporaryEmotion("loving", 3000);
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
    }

