huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
            bool codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
            uint8_t pcb_version = 0;
            if (codec_alive) {
                ESP_LOGI(TAG, "PCB version V1.0");
                pcb_version = 0;
            } else {
                ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 1));
                vTaskDelay(pdMS_TO_TICKS(50));
                codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
                if (codec_alive) {
                    ESP_LOGI(TAG, "PCB version V1.2");
                    pcb_version = 1;
                    AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
                    AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
                    QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
                    TOUCH_PAD2 = TOUCH_PAD2_2;
                    UART1_TX = UART1_TX_2;
                    UART1_RX = UART1_RX_2;
                } else {
                    ESP_LOGE(TAG, "PCB version detection error");
                }
            }
            return pcb_version;
        }

    static void touch_isr_callback(void* arg)
    {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad != nullptr) {
            touchpad->NotifyTouchEvent();
        }
    }

    static void touch_event_task(void* arg)
    {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad == nullptr) {
            ESP_LOGE(TAG, "Invalid touchpad pointer in touch_event_task");
            vTaskDelete(NULL);
            return;
        }

        while (true) {
            if (touchpad->WaitForTouchEvent()) {
                auto &app = Application::GetInstance();
                auto &board = (EspVocat &)Board::GetInstance();

                ESP_LOGD(TAG, "Touch event, TP_PIN_NUM_INT: %d", gpio_get_level(TP_PIN_NUM_INT));
                touchpad->UpdateTouchPoint();
                auto touch_event = touchpad->CheckTouchEvent();
                auto& touch_point = touchpad->GetTouchPoint();

                if (touch_event == Cst816s::TOUCH_PRESS) {
                    // Record press timestamp and start position for later recognition
                    board.touch_press_time_ms_ = esp_timer_get_time() / 1000;
                    board.swipe_start_x_ = touch_point.x;
                    board.swipe_start_y_ = touch_point.y;
                    board.swipe_start_recorded_ = true;
                }

                if (touch_event == Cst816s::TOUCH_RELEASE) {
                    // Startup special case: first touch release enters WiFi config.
                    if (app.GetDeviceState() == kDeviceStateStarting) {
                        board.swipe_start_recorded_ = false;
                        board.EnterWifiConfigMode();
                        continue;
                    }

                    // Normalize the release into a single screen gesture and route it.
                    Gesture gesture = Gesture::Tap;
                    if (board.swipe_start_recorded_) {
                        int64_t now_ms = esp_timer_get_time() / 1000;
                        int64_t duration_ms = now_ms - board.touch_press_time_ms_;
                        int delta_x = touch_point.x - board.swipe_start_x_;
                        int delta_y = touch_point.y - board.swipe_start_y_;
                        ESP_LOGI(TAG, "Touch release: start(%d,%d) end(%d,%d) delta(%d,%d) dur=%" PRId64 " ms",
                                  board.swipe_start_x_, board.swipe_start_y_,
                                  touch_point.x, touch_point.y, delta_x, delta_y, duration_ms);

                        // Edge-start awareness: a horizontal swipe that begins in
                        // the right-edge zone means "back Home" rather than page
                        // navigation (round-panel safety against a direction
                        // misread near the far edge).
                        board.swipe_from_edge_ =
                            (board.swipe_start_x_ > DISPLAY_WIDTH - kEdgeZonePx);

                        if (duration_ms >= kLongPressThresholdMs) {
                            gesture = Gesture::LongPress;
                        } else if (abs(delta_x) >= kSwipeThreshold && abs(delta_x) > abs(delta_y)) {
                            gesture = (delta_x > 0) ? Gesture::SwipeRight : Gesture::SwipeLeft;
                        } else if (abs(delta_y) >= kSwipeThreshold && abs(delta_y) > abs(delta_x)) {
                            gesture = (delta_y > 0) ? Gesture::SwipeDown : Gesture::SwipeUp;
                        } else {
                            gesture = Gesture::Tap;
                        }
                        board.swipe_start_recorded_ = false;
                    } else {
                        board.swipe_from_edge_ = false;
                    }
                    board.OnGesture(gesture);
                    board.swipe_from_edge_ = false;
                }
            }
        }
    }

    void InitializeCharge()
    {
        charge_ = new Charge(i2c_bus_, 0x55);
        xTaskCreatePinnedToCore(Charge::TaskFunction, "batterydecTask", 3 * 1024, charge_, 6, &charge_task_handle_, 0);
    }

    void InitializeCst816sTouchPad()
    {
        cst816s_ = new Cst816s(i2c_bus_, 0x15);

        xTaskCreatePinnedToCore(touch_event_task, "touch_task", 4 * 1024, cst816s_, 5, &touch_task_handle_, 1);

        const gpio_config_t int_gpio_config = {
            .pin_bit_mask = (1ULL << TP_PIN_NUM_INT),
            .mode = GPIO_MODE_INPUT,
            // .intr_type = GPIO_INTR_NEGEDGE
            .intr_type = GPIO_INTR_ANYEDGE
        };
        gpio_config(&int_gpio_config);
        gpio_install_isr_service(0);
        gpio_intr_enable(TP_PIN_NUM_INT);
        gpio_isr_handler_add(TP_PIN_NUM_INT, EspVocat::touch_isr_callback, cst816s_);
    }

    void InitializeBmi270()
    {
        esp_err_t imu_ret = Bmi270Motion::Initialize(shared_i2c_bus_handle_);
        if (imu_ret == ESP_OK) {
            bmi270_ready_ = true;
            xTaskCreatePinnedToCore(imu_event_task, "imu_task", 4 * 1024, this, 4, &imu_task_handle_, 1);
        } else {
            ESP_LOGW(TAG, "BMI270 unavailable, shake emotion disabled");
        }
    }

