huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
    static uint32_t TouchChannelFromPadGpio(gpio_num_t gpio)
    {
        if (gpio == GPIO_NUM_NC) {
            return 0;
        }
        if (gpio >= GPIO_NUM_1 && gpio <= GPIO_NUM_14) {
            return static_cast<uint32_t>(gpio);
        }
        return 0;
    }

    static void touch_slider_event_callback(touch_slider_handle_t handle, touch_slider_event_t event, int32_t data, void* cb_arg)
    {
        (void)handle;
        auto* self = static_cast<EspVocat*>(cb_arg);
        if (self == nullptr || self->display_ == nullptr) {
            return;
        }
        if (event != TOUCH_SLIDER_EVENT_POSITION) {
            ESP_LOGI(TAG, "Touch slider evt=%d data=%" PRId32, static_cast<int>(event), data);
        }

        bool gesture = false;
        if (event == TOUCH_SLIDER_EVENT_LEFT_SWIPE || event == TOUCH_SLIDER_EVENT_RIGHT_SWIPE) {
            gesture = true;
        } else if (event == TOUCH_SLIDER_EVENT_RELEASE) {
            gesture = true;
        }

        if (!gesture) {
            return;
        }

        // The outer capacitive surface is a feedback-only "pet" input.
        self->HandleOuterTouchPet();
    }

    // Open a conversation (Siri-style): show the LVGL overlay and start the voice
    // interaction. Used by the Home LongPress gesture and the EmotionLearning
    // screen's 开始 button. The overlay is dormant until SetSpeaking drives it.
    // If a conversation is already running (e.g. started by the physical BOOT
    // button or a wake word), we only surface the overlay rather than re-toggling
    // it off.
    void StartConversation()
    {
        if (ui_ != nullptr) {
            ui_->SetConversationActive(true);
        }
        auto state = Application::GetInstance().GetDeviceState();
        if (state != kDeviceStateListening && state != kDeviceStateSpeaking &&
            state != kDeviceStateConnecting && state != kDeviceStateActivating) {
            Application::GetInstance().ToggleChatState();
        }
        // A live conversation must not light-sleep (non-Home screen), but unlike
        // the static page screens it must NOT be auto-closed by the 30s idle timer
        // while the user is mid-conversation, so only refresh power-save eligibility.
        UpdatePowerSaveEligibility();
    }

    // Cycle the current emotion-learning index and refresh the on-screen name.
    void AdvanceEmotion(bool forward)
    {
        if (forward) {
            current_emotion_index_ =
                (current_emotion_index_ + 1) % kEmotionLearningCount;
        } else {
            current_emotion_index_ =
                (current_emotion_index_ + kEmotionLearningCount - 1) % kEmotionLearningCount;
        }
        ShowEmotionLearningCurrent();
    }

    void EnterEmotionLearningMode()
    {
        if (CurrentScreen() == ScreenId::EmotionLearning) {
            return;
        }
        // Entering a non-Home screen force-ends any active conversation (bug #2).
        ForceEndDialogue();
        current_emotion_index_ = 0;
        ShowEmotionLearningCurrent();  // seed the central name before showing
        if (ui_ != nullptr) {
            ui_->ShowScreen(ScreenId::EmotionLearning);
        }
        AfterScreenChange();
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_POPUP);
        ESP_LOGI(TAG, "Entered emotion learning screen");
    }

    void ShowEmotionLearningCurrent()
    {
        if (ui_ != nullptr) {
            ui_->SetEmotionLearningName(kEmotionLearningNames_[current_emotion_index_]);
        }
        ESP_LOGI(TAG, "Emotion learning current: %s",
                 kEmotionLearningNames_[current_emotion_index_]);
    }

    void EnterSettingsPage()
    {
        if (CurrentScreen() == ScreenId::Settings) {
            return;
        }
        // Entering a non-Home screen force-ends any active conversation (bug #2).
        ForceEndDialogue();
        if (ui_ != nullptr) {
            // Refresh the steppers with the real hardware values, then show the
            // screen; value changes apply live via the Task 3 callbacks.
            ui_->SetSettingsValueBrightness(backlight_ != nullptr ? backlight_->brightness() : 50);
            ui_->SetSettingsValueVolume(
                Application::GetInstance().GetAudioService().GetOutputVolume());
            ui_->ShowScreen(ScreenId::Settings);
        }
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_POPUP);
        AfterScreenChange();
        ESP_LOGI(TAG, "Entered settings screen");
    }

    static void touch_button_event_callback(touch_button_handle_t handle, uint32_t channel, touch_state_t state, void* cb_arg)
    {
        (void)handle;
        (void)channel;
        auto* self = static_cast<EspVocat*>(cb_arg);
        if (self == nullptr || self->display_ == nullptr) {
            return;
        }

        // Single-pad (PCB v1.0) outer capacitive surface: a touch is recognized
        // once per debounced interaction, on release. It is feedback-only (Pet)
        // and never changes mode, toggles chat, advances an emotion, or records
        // a drink.
        if (state == TOUCH_STATE_INACTIVE) {
            self->HandleOuterTouchPet();
        }
    }

    static void touch_cap_poll_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        while (true) {
            if (self != nullptr) {
                if (self->touch_slider_handle_ != nullptr) {
                    touch_slider_sensor_handle_events(self->touch_slider_handle_);
                } else if (self->touch_button_handle_ != nullptr) {
                    touch_button_sensor_handle_events(self->touch_button_handle_);
                }
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }
    }

    void InitializeCapacitiveTouchPads()
    {
        if (TOUCH_PAD1 == GPIO_NUM_NC) {
            ESP_LOGW(TAG, "Capacitive touch disabled: TOUCH_PAD1 NC");
            return;
        }

        const uint32_t ch1 = TouchChannelFromPadGpio(TOUCH_PAD1);
        if (ch1 == 0) {
            ESP_LOGW(TAG, "TOUCH_PAD1 GPIO %d is not a touch channel (expect GPIO1..GPIO14)", (int)TOUCH_PAD1);
            return;
        }

